//Creative Engineer ステップアップ課題　＃１

//#include<bits/stdc++.h>
#include<stdio.h>

void input(void);				//入力された YYYY/MM/DD HH24:mm-HH24:mm…を取得
void calc(int i);					//各労働時間数の計算
void weekTotal(void);			//週の労働が４０時間を超える場合の計算
int getWeekday(int y, int m, int d);				//日付から曜日を判定する
int convertTime(int t);				//分→時の変換（３０分未満切り捨て、３０分以上繰り上げ）

int year1,month1;						//集計対象年、月
int year[40],month[40],date[40];		//入力された年、月、日、の配列
int h1[40],h2[40],h3[40],h4[40];		//入力された時刻（HH）の配列
int m1[40],m2[40],m3[40],m4[40];		//入力された時刻（mm）の配列

int i,k=0;								//作業用カウンタ
int total[40];							//1日の総労働時間数(分)
int time1=0,time2=0,time3=0,time4=0,time5=0;
//順に、法定内残業時間数、法定外残業時間数、深夜残業時間数、所定休日労働時間数、法定休日労働時間数(分)
int sum_w = 0;						//週単位での総労働時間（分）
int week;							//曜日の把握を行う作業変数

/*************************************************************************************************/

int main(void) {
	input();						//入力値の取得		
	
	for(i=0;i<=k;i++){
		total[i] = ((h2[i]+h4[i])*60 + m2[i]+m4[i]) - ((h1[i]+h3[i])*60 + m1[i]+m3[i]); 	//各日の総労働時間の計算
		week = getWeekday(year[i],month[i],date[i]);		//曜日の取得
	
		sum_w = sum_w + total[i];				//週単位での労働時間
		
		calc(i);					//各労働時間数の計算
		weekTotal();			//週の労働が４０時間を超える場合の、”法定外残業時間数”の計算
	}
	//分→時の変換
	time1 = convertTime(time1);
	time2 = convertTime(time2);
	time3 = convertTime(time3);
	time4 = convertTime(time4);
	time5 = convertTime(time5);
	
	//結果の出力
	printf("\n");				//改行
	printf("%d\n",time1-1);		//法定内残業時間数
	printf("%d\n",time2);		//法定外残業時間数
	printf("%d\n",time3);		//深夜残業時間数
	printf("%d\n",time4);		//所定休日労働時間数
	printf("%d\n",time5);		//法定休日労働時間数
	
	return 0;  // 正常終了を示す値をシステムに返す
}

/*************************************************************************************************/
//以降、各関数について

//各労働時間数の計算　曜日ごとに考える
void calc(int i){
	//月曜日〜木曜日の場合
	if(week != 0 && week != 5 && week != 6){
		//法定内残業時間
		if((h1[i] == 8) && (m1[i] == 0) && total[i]>=480){			//８時間を超える場合
			time1 = time1 + 60;	
		}else if((h1[i] == 8) && (m1[i] == 0) && total[i] > 420 && total[i] < 480){  //８時間未満の場合
			time1 = time1 + total[i] - 420;
		}else if(h1[i] != 8 || m1[i] != 0){								//不就労働の場合
			time1 = time1 + 480 - (420 - ((h2[i]*60 + m2[i]) - (h1[i]*60 + m1[i]))) ;	
		}
			
		//法定外残業時間
		if(total[i] > 480){
			time2 = time2 + total[i] - 480;
		}
			
		//深夜残業時間数
		if(h4[i] >= 22){
			time3 = time3 + h4[i]*60 + m4[i] - (22*60);
		}
			
/****************************************************************/			
	//金曜日の場合	
	}else if(week == 5){	
		//法定内残業時間
		if((h1[i] == 8) && (m1[i] == 0) && total[i]>=480){					//８時間を超える場合
			time1 = time1 + 60;
		}else if((h1[i] == 8) && (m1[i] == 0) && total[i] > 420 && total[i] < 480){  //８時間未満の場合
			time1 = time1 + total[i] - 420;
		}else if(h1[i] != 8 || m1[i] != 0){									//不就労働の場合
			time1 = time1 + 480 - (420 - ((h2[i]*60 + m2[i]) - (h1[i]*60 + m1[i]))) ;
		}
			
		//法定外残業時間
		if(total[i]>480 && h4[i]<24){					//日付を跨がない場合
			time2 = time2 + total[i] - 480;
		}else if(total[i]>480 && h4[i] >= 24){				//日付を跨ぐ場合
			time2 = time2 +  total[i] - 480 - ((h4[i]*60 + m4[i]) - 24*60);
				
			//所定休日労働時間数
			time4 = time4 + ((h4[i]*60 + m4[i]) - 24*60);
		}
						
		//深夜残業時間数
		if(h4[i] >= 22){
			time3 = time3 + h4[i]*60 + m4[i] - (22*60);
		}
			
/****************************************************************/	
	//土曜日の場合	
	}else if(week == 6){					//所定休日労働時間数
		if(h4[i] < 24){						//日付を跨がない場合
			time4 = time4 + total[i];
		}else if(h4[i] >= 24){			//法定休日労働時間数（日付を跨ぐ場合）
			time4 = time4 +  total[i] - ((h4[i]*60 + m4[i]) - 24*60);
			time5 = time5 + ((h4[i]*60 + m4[i]) - 24*60);
		}
			
		//深夜残業時間数
		if(h4[i] >= 22){
			time3 = time3 + h4[i]*60 + m4[i] - (22*60);
		}		
			
/****************************************************************/		
	//日曜日の場合	
	}else if(week == 0){				//法定休日労働時間数
		time5 = time5 + total[i];
			
		//深夜残業時間数
		if(h4[i]>=22){
			time3 = time3 + h4[i]*60 + m4[i] - (22*60);
		}
	}
}

/*************************************************************************************************/		
//週の労働が４０時間を超える場合の、”法定外残業時間数”の計算、修正
void weekTotal(void){
	if(sum_w > 40*60){			
		if((h1[i] == 8) && (m1[i] == 0) && total[i]>=480){			//日の労働が８時間を超える場合
			time1 = time1 - 60;	
		}else if((h1[i] == 8) && (m1[i] == 0) && total[i] > 420 && total[i] < 480){  //日の労働が８時間未満の場合
			time1 = time1 - (total[i] - 420);
		}else if(h1[i] != 8 || m1[i] != 0){								//不就労働の場合
			time1 = time1 - (480 - (420 - ((h2[i]*60 + m2[i]) - (h1[i]*60 + m1[i])))) ;	
		}
		//法定外残業時間
		if(total[i] > 480 && sum_w < 40*60){
			time2 = time2 - (total[i] - 480);
		}
				
	time2 = time2 + sum_w - 40*60 - (total[i] - 480);
		
	if(week == 5) sum_w = 0;
	}
}

/*************************************************************************************************/		
//入力された YYYY/MM/DD HH24:mm-HH24:mm…を配列に取得
void input(void){
	
	//scanf("%d/%d",&year1,&month1);
	printf("YYYY/MM/DD HH24:mm-HH24:mm HH24:mm-HH24:mm\n");//後で消す
	while(1){
		
		 scanf("%d/%d/%d %d:%d-%d:%d %d:%d-%d:%d"
		,&year[k],&month[k],&date[k],&h1[k],&m1[k],&h2[k],&m2[k],&h3[k],&m3[k],&h4[k],&m4[k]);
		
		if(year[k] == '\0') break;		// '0'の入力でbreak
		
		k++;
		}		
}

/*************************************************************************************************/
//日付から曜日を判定する
//返し値 {0:日曜日 1:月曜日 2:火曜日 3:水曜日 4:木曜日 5:金曜日 6:土曜日}
int getWeekday(int y, int m, int d){		//引数 {年、月、日}
	 if( m < 3 ) {
        y--; m += 12;
    }
    return ( y + y/4 - y/100 + y/400 + ( 13*m + 8 )/5 + d )%7;
}

/*************************************************************************************************/
//分→時の変換（３０分未満切り捨て、３０分以上繰り上げ）
int convertTime(int t){		//引数：分表記の時間					
	if(t%60 < 30){
		t = t / 60;
	}else{
		t = t / 60 +1;
	}
	return t;		//返し値：時表記の時間
}
